{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "ironman",
    "1": "spider-man",
    "2": "loki",
    "3": "thanos",
    "4": "black widow",
    "5": "doctor strange",
    "6": "captain america",
    "7": "hulk"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "black widow": 4,
    "captain america": 6,
    "doctor strange": 5,
    "hulk": 7,
    "ironman": 0,
    "loki": 2,
    "spider-man": 1,
    "thanos": 3
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.35.2"
}
